Revit 2026 API

# HostObjAttributesGetCompoundStructure Method

---

Returns an object that represents the compound structure of the element.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public CompoundStructure GetCompoundStructure()
```
```vb
Public Function GetCompoundStructure As CompoundStructure
```
```cpp
public:
CompoundStructure^ GetCompoundStructure()
```
```fsharp
member GetCompoundStructure : unit -> CompoundStructure
```

#### Return Value

CompoundStructure

A copy of the compound structure is returned and changes made to it will not apply to the type until SetCompoundStructure is called. From this object the layers of a compound structure can be accessed. If the element does not have a compound structure then this method will return .

#### Reference

HostObjAttributes Class

Autodesk.Revit.DB Namespace